tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "axel"
brew "openjdk"
brew "bfg"
brew "bind"
brew "cmake"
brew "curl"
brew "dua-cli"
brew "fd"
brew "fnm"
brew "fontforge"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "graphviz"
brew "gsmartcontrol"
brew "jq"
brew "protobuf"
brew "knot"
brew "lazygit"
brew "six"
brew "llvm"
brew "mas"
brew "mtr"
brew "nano"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "openjdk@11"
brew "openjdk@8"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "telnet"
brew "thefuck"
brew "tree"
brew "wgcf"
brew "wget"
brew "whois"
brew "zsh"
cask "android-platform-tools"
cask "anydesk"
cask "appcleaner"
cask "discord"
cask "eqmac"
cask "exifcleaner"
cask "firefox"
cask "firefox-developer-edition"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "hackintool"
cask "iina"
cask "intel-power-gadget"
cask "iterm2"
cask "kap"
cask "keka"
cask "kekaexternalhelper"
cask "maccy"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "motrix"
cask "neteasemusic"
cask "nrlquaker-winbox"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "rectangle"
cask "scroll-reverser"
cask "setapp"
cask "signal"
cask "sketch"
cask "snipaste"
cask "sogouinput"
cask "sourcetree"
cask "surge"
cask "switchhosts"
cask "teamviewer"
cask "telegram"
cask "temurin"
cask "tencent-meeting"
cask "termius"
cask "textmate"
cask "usr-sse2-rdm"
cask "visual-studio-code"
cask "webpquicklook"
cask "wireshark"
mas "AdGuard for Safari", id: 1440147259
mas "FastZip", id: 1565629813
mas "Numbers", id: 409203825
mas "Osase", id: 6443595470
mas "Rayon", id: 1609781496
mas "Shareful", id: 1522267256
mas "uBlacklist for Safari", id: 1547912640
mas "Velja", id: 1607635845
mas "WeChat", id: 836500024
mas "WeCom", id: 1189898970
mas "Xcode", id: 497799835
vscode "antfu.smart-clicks"
vscode "bashmish.es6-string-css"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "CodeSandbox-io.codesandbox-projects"
vscode "cssho.vscode-svgviewer"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dtsvet.vscode-wasm"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "google.wireit"
vscode "icrawl.discord-vscode"
vscode "jock.svg"
vscode "magicstack.MagicPython"
vscode "meganrogge.template-string-converter"
vscode "mintlify.document"
vscode "ms-azuretools.vscode-docker"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-typescript-next"
vscode "PKief.material-icon-theme"
vscode "PrateekMahendrakar.prettyxml"
vscode "Prisma.prisma"
vscode "rbuckton.deoptexplorer-vscode"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "Thog.vscode-asl"
vscode "Tobermory.es6-string-html"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WakaTime.vscode-wakatime"
vscode "xabikos.JavaScriptSnippets"
vscode "YiJie.vscode-comment-queries"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhangciwu.swig-tpl"
vscode "zjcompt.es6-string-javascript"
vscode "znck.grammarly"
