tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "github/gh"
tap "gmerlino/udffsck"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "localsend/localsend"
tap "pouriyajamshidi/tap"
tap "rfidresearchgroup/proxmark3"
tap "teamookla/speedtest"
brew "ack"
brew "zstd"
brew "argyll-cms"
brew "aria2"
brew "python@3.12"
brew "glib"
brew "automake"
brew "axel"
brew "bat"
brew "bfg"
brew "bind"
brew "cabextract"
brew "ccache"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "dua-cli"
brew "dufs"
brew "dust"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "libtool"
brew "python@3.11"
brew "fontforge"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "libusb"
brew "go"
brew "jasper"
brew "graphviz"
brew "gtk+3"
brew "gsmartcontrol"
brew "htop"
brew "jq"
brew "lazygit"
brew "libiconv"
brew "llvm"
brew "llvm@16"
brew "mas"
brew "mtr"
brew "nano"
brew "ncdu"
brew "nexttrace"
brew "ninja"
brew "nmap"
brew "openjdk@11"
brew "pipx"
brew "pkg-config"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "qemu"
brew "ripgrep"
brew "rye"
brew "six"
brew "stuntman"
brew "t-rec"
brew "telnet"
brew "thefuck"
brew "tree"
brew "wgcf"
brew "wget"
brew "wget2"
brew "whois"
brew "zsh"
brew "cloudflare/cloudflare/curl"
brew "jesseduffield/lazydocker/lazydocker"
brew "pouriyajamshidi/tap/tcping"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "betterdisplay"
cask "discord"
cask "emby"
cask "eqmac"
cask "exifcleaner"
cask "firefox"
cask "firefox@developer-edition"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "gimp"
cask "git-credential-manager"
cask "google-chrome"
cask "google-chrome@canary"
cask "grandperspective"
cask "hex-fiend"
cask "hidock"
cask "iina"
cask "iterm2"
cask "kap"
cask "keka"
cask "kekaexternalhelper"
cask "latest"
cask "localsend"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "minecraft"
cask "moonlight"
cask "motrix"
cask "neteasemusic"
cask "nrlquaker-winbox"
cask "obsidian"
cask "openmtp"
cask "orbstack"
cask "orion"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "qlzipinfo"
cask "quicklook-json"
cask "quicklookase"
cask "raspberry-pi-imager"
cask "rectangle-pro"
cask "reqable"
cask "scroll-reverser"
cask "setapp"
cask "snipaste"
cask "soduto"
cask "surge"
cask "switchhosts"
cask "telegram"
cask "temurin"
cask "tencent-meeting"
cask "termius"
cask "typora"
cask "uninstallpkg"
cask "utm"
cask "visual-studio-code"
cask "webpquicklook"
cask "wezterm"
cask "wifiman"
cask "windterm"
cask "wireshark"
cask "xquartz"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "AmorphousDiskMark", id: 1168254295
mas "AmorphousMemoryMark", id: 1495719766
mas "CrystalFetch", id: 6454431289
mas "Disk Speed Test", id: 425264550
mas "FastZip", id: 1565629813
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "NZBin", id: 979608899
mas "OpenSpeedTest-Server", id: 1579499874
mas "Pages", id: 409201541
mas "Shareful", id: 1522267256
mas "Tencent Lemon Lite", id: 1449962996
mas "Velja", id: 1607635845
mas "WeChat", id: 836500024
vscode "antfu.smart-clicks"
vscode "antfu.unocss"
vscode "bashmish.es6-string-css"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codesandbox-io.codesandbox-projects"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dgeibi.alias-tool"
vscode "donjayamanne.githistory"
vscode "dprint.dprint"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "flowtype.flow-for-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.wireit"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "henoc.svgeditor"
vscode "icrawl.discord-vscode"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jock.svg"
vscode "lkrms.inifmt"
vscode "lokalise.i18n-ally"
vscode "magicstack.magicpython"
vscode "meganrogge.template-string-converter"
vscode "mintlify.document"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "orta.vscode-jest"
vscode "peakchen90.open-html-in-browser"
vscode "pkief.material-icon-theme"
vscode "prateekmahendrakar.prettyxml"
vscode "prisma.prisma"
vscode "rbuckton.deoptexplorer-vscode"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "thog.vscode-asl"
vscode "tlent.jest-snapshot-language-support"
vscode "tobermory.es6-string-html"
vscode "tzachovadia.todo-list"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "viijay-kr.react-ts-css"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wakatime.vscode-wakatime"
vscode "withfig.fig"
vscode "xabikos.javascriptsnippets"
vscode "yijie.vscode-comment-queries"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhangciwu.swig-tpl"
vscode "zjcompt.es6-string-javascript"
