tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "axel"
brew "openjdk"
brew "bfg"
brew "bind"
brew "cmake"
brew "curl"
brew "dua-cli"
brew "fd"
brew "fnm"
brew "fontforge"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "graphviz"
brew "gsmartcontrol"
brew "jq"
brew "protobuf"
brew "knot"
brew "lazygit"
brew "six"
brew "llvm"
brew "mas"
brew "nano"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "openjdk@11"
brew "openjdk@8"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "telnet"
brew "thefuck"
brew "tree"
brew "wgcf"
brew "wget"
brew "whois"
brew "zsh"
cask "android-file-transfer"
cask "android-platform-tools"
cask "anydesk"
cask "appcleaner"
cask "discord"
cask "docker"
cask "exifcleaner"
cask "firefox"
cask "firefox-developer-edition"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "hackintool"
cask "iina"
cask "intel-power-gadget"
cask "iterm2"
cask "kap"
cask "keka"
cask "kekaexternalhelper"
cask "maccy"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "motrix"
cask "neteasemusic"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "scroll-reverser"
cask "signal"
cask "snipaste"
cask "sogouinput"
cask "surge"
cask "switchhosts"
cask "telegram"
cask "temurin"
cask "tencent-meeting"
cask "termius"
cask "textmate"
cask "visual-studio-code"
cask "webpquicklook"
cask "wireshark"
mas "AdGuard for Safari", id: 1440147259
mas "FastZip", id: 1565629813
mas "iRightMouse Lite", id: 1552554632
mas "Numbers", id: 409203825
mas "Rayon", id: 1609781496
mas "Shareful", id: 1522267256
mas "uBlacklist for Safari", id: 1547912640
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
